---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSizeSet.Clear
source: html/d16005a1-8cc9-76a3-4d6d-9e96f6ce4857.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet.Clear Method

Removes every wire size from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```